Merge pull request #584 from slopezz/update-m4-blog-post
Update M4 observability blog post with logging platform
